---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarBendData.HookAngle1
source: html/d9346b7f-10ec-9a28-cdc9-53d9176c9367.htm
---
# Autodesk.Revit.DB.Structure.RebarBendData.HookAngle1 Property

The angle of the hook at the end.

## Syntax (C#)
```csharp
public int HookAngle1 { get; set; }
```